tutorials/combustion/fireFoam/les/oppositeBurningPanels/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          panelRegion;

faceZones       (fRight_zone fLeft_zone);

oneD            true;

sampleMode      nearestPatchFace;

oneDPolyPatchType empty; //wedge

extrudeModel    linearNormal;

nLayers         5;

expansionRatio  1;

adaptMesh       true; // mapped for both

linearNormalCoeffs
{
    thickness       0.01;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
